#!/usr/bin/env python
# -*- coding: utf-8 -*-

#第一行注释是为了告诉Linux/OS X系统，这是一个Python可执行程序，Windows系统会忽略这个注释；
#第二行注释是为了告诉Python解释器，按照UTF-8编码读取源代码，否则，中文输出可能会有乱码。
print('Hello,World')#第一行代码前面不能有空格
print('\n')
#-----------------------------------------------------------------------------------------------------

#编码
#输出中文
print u'中文' 
print('\n')
#-----------------------------------------------------------------------------------------------------

#转义
#字符串前面加个前缀 r ，表示这是一个 raw 字符串，里面的字符就不需要转义了
print r'\(~_~)/ \n(~_~)/'
#多行字符串，可以用'''...'''表示
print ur'''~\(≧▽≦)/~
(*^__^*) 嘻嘻……
\(~_~)/ \n(~_~)/'''
print('\n')
#-----------------------------------------------------------------------------------------------------

#运算
#与and 或or 非not  布尔True False
#-----------------------------------------------------------------------------------------------------

#列表
nums = [1,4,5,8]
nums.append("unknow")#添加  数据类型不限  添加到尾部
nums.insert(0,'first')#插入到指定位置
print(nums[0])#按位置取值
print(nums[-1])#取倒数第一个 -2倒数第二...
nums.pop()#删除 最后一个
print(nums[-1])
nums.pop(0)#删除 指定位置
print(nums[0])
print('\n')

#循环 
#迭代
names = ["Jack","Rose"]
for name in names:
	print(name)
#range()函数 生成整数序列 
for x in range(5):
	print(x)
for x in range(1,5):
	print(x)
print('\n')


